Rainchus/marioparty4/src/REL/m401Dll/main.c
void fn_2_C1C(omObjData *object)
{
	M401Work2D *temp_r31;
	s32 i;
	s32 j;
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(M401Work2D), MEMORY_DEFAULT_NUM);
	temp_r31 = object->data;
	for(i=0; i<4; i++) {
		temp_r31->unk0[i] = espEntry(lbl_2_data_80[GWPlayerCfg[i].character], 2, 0);
		espDispOff(temp_r31->unk0[i]);
		espDrawNoSet(temp_r31->unk0[i], 0);
		espPosSet(temp_r31->unk0[i], PLAYER_POS_X(i, 37, 438), PLAYER_POS_Y(i, 59, 358));
		temp_r31->unk80[i] = espEntry(0x20002F, 3, 0);
		espDispOff(temp_r31->unk80[i]);
		espDrawNoSet(temp_r31->unk80[i], 0);
		espPosSet(temp_r31->unk80[i], PLAYER_POS_X(i, 73, 438), PLAYER_POS_Y(i, 61, 358));
		temp_r31->unk88[i] = espEntry(0x200030, 4, 0);
		espDispOff(temp_r31->unk88[i]);
		espDrawNoSet(temp_r31->unk88[i], 0);
		espPosSet(temp_r31->unk88[i], PLAYER_POS_X(i, 73, 438), PLAYER_POS_Y(i, 61, 358));
		espColorSet(temp_r31->unk88[i], 0, 0, 0);
		espTPLvlSet(temp_r31->unk88[i], 0.5f);
		for(j=0; j<2; j++) {
			temp_r31->unk8[i][j] = espEntry(0x20002E, 1, 0);
			espDispOff(temp_r31->unk8[i][j]);
			espDrawNoSet(temp_r31->unk8[i][j], 0);
			espPosSet(temp_r31->unk8[i][j], PLAYER_POS_X(i, 69+(j*20), 438), PLAYER_POS_Y(i, 63, 358));
			espAttrSet(temp_r31->unk8[i][j], HUSPR_ATTR_NOANIM);
		}
		for(j=0; j<3; j++) {
			temp_r31->unk50[i][j] = espEntry(0x20002D, 0, 0);
			espDispOff(temp_r31->unk50[i][j]);
			espDrawNoSet(temp_r31->unk50[i][j], 0);
			espAttrSet(temp_r31->unk50[i][j], HUSPR_ATTR_NOANIM);
			temp_r31->unk68[i][j] = espEntry(0x20002D, 0, 0);
			espDispOff(temp_r31->unk68[i][j]);
			espDrawNoSet(temp_r31->unk68[i][j], 0);
			espAttrSet(temp_r31->unk68[i][j], HUSPR_ATTR_NOANIM);
		}
		espBankSet(temp_r31->unk50[i][0], 10);
		espBankSet(temp_r31->unk68[i][0], 11);
		temp_r31->unk90[i] = 1.0f;
		temp_r31->unkA0[i] = 1.0f;
		temp_r31->unk130[i] = 0;
		temp_r31->unk138[i] = 0;
	}
	object->func = fn_2_11D0;
}

void fn_2_15C4(s16 arg0);

void fn_2_11D0(omObjData *object)
{
	M401Work2D *temp_r31;
	s32 i;
	s32 j;
	omObjData *temp_r28;
	Vec sp18;
	Vec spC;
	M401WorkPlayer *sp8;
	temp_r31 = object->data;
	for(i=0; i<4; i++) {
		sp8 = lbl_2_bss_118[i]->data;
		if(temp_r31->unk130[i]) {
			temp_r28 = lbl_2_bss_118[i];
			sp18.x = temp_r28->trans.x;
			sp18.y = temp_r28->trans.y;
			sp18.z = temp_r28->trans.z;
			fn_2_10240(&sp18, &spC);
			for(j=0; j<3; j++) {
				espPosSet(temp_r31->unk50[i][j], (-20.0f+spC.x+temp_r31->unkF0[i])+(j*16), 20.0f+spC.y+temp_r31->unk100[i]);
				espTPLvlSet(temp_r31->unk50[i][j], temp_r31->unk90[i]);
			}
			temp_r31->unkC0[i] -= 0.5f;
			temp_r31->unk100[i] -= 1.0f;
			if(temp_r31->unk130[i] < 15) {
				temp_r31->unk90[i] -= 1.0f/15.0f;
			}
			if(--temp_r31->unk130[i] == 0) {
				espDispOff(temp_r31->unk50[i][0]);
				espDispOff(temp_r31->unk50[i][1]);
			}
		}
		if(temp_r31->unk138[i]) {
			temp_r28 = lbl_2_bss_118[i];
			sp18.x = temp_r28->trans.x;
			sp18.y = temp_r28->trans.y;
			sp18.z = temp_r28->trans.z;
			fn_2_10240(&sp18, &spC);
			for(j=0; j<2; j++) {
				espPosSet(temp_r31->unk68[i][j], (-20.0f+spC.x+temp_r31->unk110[i])+(j*16), -20.0f+spC.y+temp_r31->unk120[i]);
				espTPLvlSet(temp_r31->unk68[i][j], temp_r31->unkA0[i]);
			}
			temp_r31->unkE0[i] += 0.5f;
			temp_r31->unk120[i] += 1.0f;
			if(temp_r31->unk138[i] < 15) {
				temp_r31->unkA0[i] -= 1.0f/15.0f;
			}
			if(--temp_r31->unk138[i] == 0) {
				espDispOff(temp_r31->unk68[i][0]);
				espDispOff(temp_r31->unk68[i][1]);
			}
		}
		fn_2_15C4(i);
	}
}

void fn_2_15C4(s16 arg0)
{
	M401Work2D *temp_r31;
	s32 temp_r30;
	M401WorkPlayer *temp_r29;
	temp_r31 = lbl_2_bss_E0->data;
	temp_r29 = lbl_2_bss_118[arg0]->data;
	temp_r30 = temp_r29->unk72;
	espBankSet(temp_r31->unk8[arg0][0], temp_r30/10);
	espBankSet(temp_r31->unk8[arg0][1], temp_r30%10);
}

void fn_2_169C(s16 arg0)
{
	M401Work2D *temp_r31;
	s32 i;
	M401WorkPlayer *temp_r28;
	temp_r31 = lbl_2_bss_E0->data;
	temp_r28 = lbl_2_bss_118[arg0]->data;
	for(i=0; i<2; i++ ){
		espDispOn(temp_r31->unk50[arg0][i]);
	}
	temp_r31->unk90[arg0] = 1;
	temp_r31->unkC0[arg0] = PLAYER_POS_Y(arg0, 52, 398);
	temp_r31->unkB0[arg0] = PLAYER_POS_X(arg0, 41, 442);
	temp_r31->unk100[arg0] = 0;
	temp_r31->unkF0[arg0] = 0;
	espBankSet(temp_r31->unk50[arg0][1], temp_r28->unk74);
	temp_r31->unk130[arg0] = 45;
}

void fn_2_1858(s16 arg0, s16 arg1)
{
	M401Work2D *temp_r31;
	M401WorkPlayer *temp_r29;
	s32 i;
	temp_r31 = lbl_2_bss_E0->data;
	temp_r29 = lbl_2_bss_118[arg0]->data;
	for(i=0; i<2; i++ ){
		espDispOn(temp_r31->unk68[arg0][i]);
	}
	temp_r31->unkA0[arg0] = 1;
	temp_r31->unkE0[arg0] = PLAYER_POS_Y(arg0, 20, 398);
	temp_r31->unkD0[arg0] = PLAYER_POS_X(arg0, 41, 442);
	temp_r31->unk120[arg0] = 0;
	temp_r31->unk110[arg0] = 0;
	espBankSet(temp_r31->unk68[arg0][1], arg1);
	temp_r31->unk138[arg0] = 45;
	temp_r31->unk140[arg0] = arg1;
	temp_r29->unk72 -= arg1;
	if(temp_r29->unk72 < 0) {
		temp_r29->unk72 = 0;
	}
}

float lbl_2_data_A0[] = {
	-500,
	-8500,
	-17500,
	-26500,
	-99000
};

float lbl_2_data_B4[] = {
	-9100,
	-18100,
	-27100,
	-36100,
	-45100,
	-100000
};

void fn_2_1A38(omObjData *object);
void fn_2_1B80(omObjData *object);
void fn_2_1CF0(omObjData *object);
void fn_2_1DE8(omObjData *object);
void fn_2_20B0(omObjData *object);
void fn_2_2CBC(omObjData *object);
void fn_2_2D64(omObjData *object);
void fn_2_2DCC(omObjData *object);
void fn_2_2E20(omObjData *object);
void fn_2_2ED0(omObjData *object);

omObjFunc lbl_2_data_CC[][2] = {
	fn_2_1A38,
	fn_2_2CBC,
	fn_2_1B80,
	fn_2_2D64,
	fn_2_1CF0,
	fn_2_2DCC,
	fn_2_1DE8,
	fn_2_2E20,
	fn_2_20B0,
	fn_2_2ED0
};

char *lbl_2_data_124[] = {
	"kaitei01",
	"kaitei02",
	"kaitei03",
	"kaitei04",
	"kaitei05"
};

s32 lbl_2_data_138[] = {
	0x5C0002,
	0x5C0002,
	0x5C0002,
	0x5C0002,
	0x5C0002,
	0x5C0002,
	0x5C0002,
	0x5C0002,
};

omObjData *fn_2_FC40(s16 arg0, Vec *arg1, Vec *arg2, Vec *arg3);
void fn_2_E6BC(omObjData *object, float arg2, float arg3, float arg4, float arg5, float arg6);

void fn_2_1A38(omObjData *object)
{
	Vec sp20;
	Vec sp14;
	Vec sp8;
	HsfObject *temp_r31 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[0]);
	omObjData *temp_r30;
	temp_r31->type = 2;
	sp20.x = -2500;
	sp20.y = 150;
	sp20.z = -6800;
	sp14.x = 50;
	sp14.y = 50;
	sp14.z = 50;
	sp8.x = 1500;
	sp8.y = 150;
	sp8.z = -4800;
	temp_r30 = fn_2_FC40(18, &sp20, &sp14, &sp8);
	fn_2_E6BC((omObjData *)temp_r30->work[0], 5, 1.5, 0.2, 0.8, 3);
}

void fn_2_1B80(omObjData *object)
{
	Vec sp14;
	Vec sp8;
	omObjData *temp_r31;
	HsfObject *temp_r30 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[1]);
	temp_r30->type = 2;
	sp14.x = -1000;
	sp14.y = 0;
	sp14.z = -9100;
	sp8.x = 150;
	sp8.y = 100;
	sp8.z = 100;
	temp_r31 = fn_2_FC40(14, &sp14, &sp8, &sp14);
	omSetRot(temp_r31, 3, 0, 0);
	omSetSca(temp_r31, 0, 0, 50);
	fn_2_E6BC((omObjData *)temp_r31->work[0], 4.5, 2.5, 0.08, 0.9, 1);
}

void fn_2_1CF0(omObjData *object)
{
	Vec sp20;
	Vec sp14;
	Vec sp8;
	HsfObject *temp_r31 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[2]);
	temp_r31->type = 2;
	sp20.x = 500;
	sp20.y = 0;
	sp20.z = -24300;
	sp14.x = 200;
	sp14.y = 100;
	sp14.z = 100;
	sp8.x = 1000;
	sp8.y = 0;
	sp8.z = -16300;
	fn_2_FC40(40, &sp20, &sp14, &sp8);
}

void fn_2_91AC(omObjData *object, Vec *pos);

void fn_2_1DE8(omObjData *object)
{
	Vec sp2C;
	Vec sp20;
	Vec sp14;
	Vec sp8;
	omObjData *temp_r31;
	HsfObject *temp_r30 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[3]);
	temp_r30->type = 2;
	sp2C.x = 0;
	sp2C.y = -150.0f+((1.0f/255.0f)*(300.0f*(u32)frand8()));
	sp2C.z = -23000;
	fn_2_91AC(lbl_2_bss_100[0], &sp2C);
	sp2C.x = 0;
	sp2C.y = -150.0f+((1.0f/255.0f)*(300.0f*(u32)frand8()));
	sp2C.z = -25000;
	fn_2_91AC(lbl_2_bss_100[1], &sp2C);
	sp2C.x = 5500;
	sp2C.y = 0;
	sp2C.z = -29800;
	sp20.x = 100;
	sp20.y = 100;
	sp20.z = 100;
	sp14.x = -1500;
	sp14.y = 0;
	sp14.z = -24900;
	temp_r31 = fn_2_FC40(20, &sp2C, &sp20, &sp14);
	fn_2_E6BC((omObjData *)temp_r31->work[0], 6, 1.5f, 0.2f, 0.8f, 3.5f);
	sp8.x = -650;
	sp8.y = -360;
	sp8.z = -26300;
	lbl_2_bss_D0 = fn_2_10A88(&sp8, 3);
	lbl_2_bss_90[0] = HuAudFXEmiterPlay(1291, &sp8);
}

void fn_2_20B0(omObjData *object)
{
	Vec sp8;
	HsfObject *temp_r30 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[4]);
	temp_r30->type = 2;
	Hu3DModelAttrReset(object->model[7], 1);
	sp8.x = 0;
	sp8.y = -370;
	sp8.z = -43000;
	lbl_2_bss_8 = fn_2_10A88(&sp8, 3);
	lbl_2_bss_90[1] = HuAudFXEmiterPlay(1291, &sp8);
	sp8.x = 380;
	sp8.y = -440;
	sp8.z = -32000;
	lbl_2_bss_CC = fn_2_10A88(&sp8, 3);
	lbl_2_bss_90[2] = HuAudFXEmiterPlay(1291, &sp8);
	Hu3DModelAttrReset(object->model[2], 1);
	Hu3DModelAttrSet(object->model[2], 0xC0000001);
}

