Rainchus/marioparty4/src/REL/m401Dll/main.c
void fn_2_21F8(omObjData *object)
{
	Vec sp2C;
	Vec sp20;
	Vec sp14;
	Vec sp8;
	s32 temp_r30;
	HsfObject *temp_r29 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[0]);
	s32 temp_r28;
	temp_r29->type = 2;
	Hu3DModelAttrReset(object->model[0], 1);
	Hu3DModelAttrReset(object->model[1], 1);
	Hu3DModelAttrSet(object->model[0], 0x40000001);
	Hu3DModelAttrSet(object->model[1], 0x40000001);
	Hu3DModelAttrReset(object->model[3], 1);
	lbl_2_bss_44.x = 0;
	lbl_2_bss_44.y = 100;
	lbl_2_bss_44.z = 0;
	lbl_2_bss_38.x = 0;
	lbl_2_bss_38.y = 1000;
	lbl_2_bss_38.z = -1500;
	lbl_2_bss_2C.x = 0;
	lbl_2_bss_2C.y = 1;
	lbl_2_bss_2C.z = 0;
	Hu3DCameraPosSetV(1, &lbl_2_bss_44, &lbl_2_bss_2C, &lbl_2_bss_38);
	Hu3DCameraPerspectiveSet(1, lbl_2_bss_12C, lbl_2_bss_128, lbl_2_bss_124, 1.2f);
	lbl_2_bss_54 = lbl_2_bss_44;
	fn_2_D088(NULL);
	sp20 = lbl_2_bss_44;
	VECSubtract(&lbl_2_bss_38, &lbl_2_bss_44, &sp2C);
	VECNormalize(&sp2C, &sp2C);
	HuAudFXListnerSetEX(&sp20, &sp2C, lbl_2_bss_88, lbl_2_bss_84, 300, 300, 300);
	sp14.x = 300;
	sp14.y = -450;
	sp14.z = -3100;
	lbl_2_bss_D8 = fn_2_10A88(&sp14, 3);
	lbl_2_bss_90[0] = HuAudFXEmiterPlay(1291, &sp14);
	sp14.x = -300;
	sp14.y = -340;
	sp14.z = -4720;
	lbl_2_bss_D4 = fn_2_10A88(&sp14, 3);
	lbl_2_bss_90[1] = HuAudFXEmiterPlay(1291, &sp14);
	Hu3DModelAttrReset(object->model[2], 1);
	Hu3DModelAttrSet(object->model[2], 0xC0000001);
	temp_r28 = 4;
	for(temp_r30=0; temp_r30<temp_r28; temp_r30++) {
		sp8.x = -340.0f+((1.0f/255.0f)*(680.0f*(u32)frand8()));
		sp8.y = -250.0f+((1.0f/255.0f)*(500.0f*(u32)frand8()));
		sp8.z = ((-1550.0f-(temp_r30*260))-40.0f)+((1.0f/255.0f)*(80.0f*(u32)frand8()));
		fn_2_10A88(&sp8, 0);
	}
}

typedef struct work_2FA4 {
	s32 unk0;
	float unk4;
	Vec unk8;
	Vec unk14[2];
	s16 unk2C;
} Work2FA4;

void fn_2_26E0(omObjData *object)
{
	Vec sp2C;
	Vec sp20;
	Vec sp14;
	Vec sp8;
	Work2FA4 *temp_r30;
	s32 temp_r29;
	Hu3DModelAttrReset(object->model[4], 1);
	Hu3DModelClusterAttrSet(object->model[4], 0, 0xC0000001);
	Hu3DModelAttrReset(object->model[8], 1);
	Hu3DModelAttrSet(object->model[8], 0x40000001);
	Hu3DModelAttrSet(object->model[4], 0x40000001);
	Hu3DModelShadowMapSet(object->model[4]);
	Hu3DModelAttrReset(object->model[5], 1);
	Hu3DModelPosSet(object->model[4], 0, 0, 0);
	Hu3DModelAmbSet(object->model[4], 1, 1, 1);
	Hu3DModelPosSet(object->model[5], 0, 0, 0);
	Hu3DModelPosSet(object->model[6], 0, 0, 0);
	temp_r30 = lbl_2_bss_10C->data;
	if(lbl_2_bss_BA) {
		temp_r30->unk14[0].x = 210;
		temp_r30->unk14[0].y = 1018;
		temp_r30->unk14[0].z = 0;
		temp_r30->unk14[1].x = -160;
		temp_r30->unk14[1].y = 1020;
		temp_r30->unk14[1].z = -50;
		for(temp_r29=0; temp_r29<2; temp_r29++) {
			Hu3DModelPosSet(object->model[temp_r29+9], temp_r30->unk14[temp_r29].x, temp_r30->unk14[temp_r29].y, temp_r30->unk14[temp_r29].z);
			Hu3DModelAttrReset(object->model[temp_r29+9], 1);
		}
		Hu3DMotionSet(object->model[10], object->motion[0]);
		Hu3DMotionSet(object->model[9], object->motion[2]);
	} else {
		temp_r30->unk14[0].x = 210;
		temp_r30->unk14[0].y = 1018;
		temp_r30->unk14[0].z = 0;
		temp_r30->unk14[1].x = -160;
		temp_r30->unk14[1].y = 1020;
		temp_r30->unk14[1].z = -50;
		for(temp_r29=0; temp_r29<2; temp_r29++) {
			Hu3DModelPosSet(object->model[temp_r29+9], temp_r30->unk14[temp_r29].x, temp_r30->unk14[temp_r29].y, temp_r30->unk14[temp_r29].z);
			Hu3DModelAttrReset(object->model[temp_r29+9], 1);
		}
		Hu3DMotionSet(object->model[10], object->motion[1]);
		Hu3DMotionSet(object->model[9], object->motion[2]);
	}
	Hu3DModelAttrSet(object->model[9], 0x40000001);
	Hu3DModelAttrSet(object->model[10], 0x40000001);
	Hu3DModelRotSet(object->model[9], 0, 90, 0);
	Hu3DModelPosSet(object->model[11], 210, 1018, 0);
	Hu3DModelRotSet(object->model[11], 0, 90, 0);
	Hu3DModelAttrReset(object->model[11], 1);
	Hu3DModelAttrSet(object->model[11], 0x40000001);
	sp2C.x = 0;
	sp2C.y = 1300;
	sp2C.z = 1300;
	sp20.x = 0;
	sp20.y = 920;
	sp20.z = -100;
	sp14.x = 0;
	sp14.y = 1;
	sp14.z = 0;
	Hu3DCameraPosSetV(1, &sp2C, &sp14, &sp20);
	lbl_2_bss_12C = 45;
	Hu3DShadowData.unk_08.x = lbl_2_bss_12C;
	MTXLightPerspective(Hu3DShadowData.unk_68, lbl_2_bss_12C, 1.2f, 0.5f, -0.5f, 0.5f, 0.5f);
	Hu3DCameraPerspectiveSet(1, lbl_2_bss_12C, lbl_2_bss_128, lbl_2_bss_124, 1.2f);
	VECSubtract(&sp20, &sp2C, &sp8);
	VECNormalize(&sp8, &sp8);
	HuAudFXListnerUpdate(&sp2C, &sp8);
}

void fn_2_2CBC(omObjData *object)
{
	HsfObject *temp_r30 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[0]);
	temp_r30->type = -1;
	Hu3DModelAttrSet(object->model[3], 1);
	lbl_2_bss_D8->work[0] = 1;
	Hu3DModelAttrSet(object->model[2], 1);
	HuAudFXStop(lbl_2_bss_90[0]);
	HuAudFXStop(lbl_2_bss_90[1]);
}

void fn_2_2D64(omObjData *object)
{
	HsfObject *temp_r31 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[1]);
	temp_r31->type = -1;
	lbl_2_bss_D4->work[0] = 1;
}

void fn_2_2DCC(omObjData *object)
{
	HsfObject *temp_r31 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[2]);
	temp_r31->type = -1;
}

void fn_2_2E20(omObjData *object)
{
	HsfObject *temp_r30 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[3]);
	temp_r30->type = -1;
	Hu3DModelAttrSet(lbl_2_bss_100[0]->model[0], 1);
	Hu3DModelAttrSet(lbl_2_bss_100[1]->model[0], 1);
	lbl_2_bss_D0->work[0] = 1;
	HuAudFXStop(lbl_2_bss_90[0]);
}

void fn_2_2ED0(omObjData *object)
{
	HsfObject *temp_r30 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[4]);
	temp_r30->type = -1;
	Hu3DModelAttrSet(object->model[7], 1);
	Hu3DModelAttrSet(object->model[0], 1);
	lbl_2_bss_8->work[0] = 1;
	lbl_2_bss_CC->work[0] = 1;
	Hu3DModelAttrSet(object->model[2], 1);
	HuAudFXStop(lbl_2_bss_90[1]);
	HuAudFXStop(lbl_2_bss_90[2]);
}

void fn_2_2F9C(omObjData *object)
{
	
}

void fn_2_2FA0(omObjData *object)
{
	
}

void fn_2_33B4(omObjData *object);

void fn_2_2FA4(omObjData *object)
{
	Work2FA4 *temp_r30;
	s32 temp_r29;
	HsfObject *temp_r28;
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work2FA4), MEMORY_DEFAULT_NUM);
	temp_r30 = object->data;
	fn_2_D088(NULL);
	temp_r30->unk0 = 0;
	temp_r30->unk8.x = 0;
	temp_r30->unk8.y = 0;
	temp_r30->unk8.z = 0;
	temp_r30->unk2C = 0;
	object->model[0] = Hu3DModelCreateFile(0x200000);
	Hu3DModelAttrSet(object->model[0], 1);
	object->model[1] = Hu3DModelCreateFile(0x200001);
	Hu3DModelAttrSet(object->model[1], 1);
	object->model[2] = Hu3DModelCreateFile(0x200007);
	Hu3DModelAttrSet(object->model[2], 1);
	Hu3DModelAttrSet(object->model[2], 0x40000001);
	object->model[3] = Hu3DModelCreateFile(0x20001F);
	Hu3DModelAttrSet(object->model[3], 1);
	object->model[4] = Hu3DModelCreateFile(0x200020);
	Hu3DModelAttrSet(object->model[4], 1);
	object->model[11] = Hu3DModelCreateFile(0x20002C);
	Hu3DModelAttrSet(object->model[11], 1);
	object->model[7] = Hu3DModelCreateFile(0x200003);
	Hu3DModelAttrSet(object->model[7], 1);
	object->model[8] = Hu3DModelCreateFile(0x200023);
	Hu3DModelAttrSet(object->model[8], 1);
	object->model[9] = Hu3DModelCreateFile(0x200028);
	Hu3DModelAttrSet(object->model[9], 1);
	object->model[10] = Hu3DModelCreateFile(0x200028);
	Hu3DModelAttrSet(object->model[10], 1);
	Hu3DModelShadowSet(object->model[10]);
	object->model[5] = Hu3DModelCreateFile(0x200021);
	Hu3DModelAttrSet(object->model[5], 1);
	object->model[6] = Hu3DModelCreateFile(0x200022);
	Hu3DModelAttrSet(object->model[6], 1);
	object->motion[0] = Hu3DJointMotionFile(object->model[10], 0x200029);
	object->motion[1] = Hu3DJointMotionFile(object->model[10], 0x20002A);
	object->motion[2] = Hu3DJointMotionFile(object->model[9], 0x20002B);
	Hu3DModelPosSet(object->model[1], 0, 0, -1500);
	Hu3DModelShadowMapSet(object->model[0]);
	for(temp_r29=0; temp_r29<5; temp_r29++) {
		temp_r28 = Hu3DModelObjPtrGet(object->model[0], lbl_2_data_124[temp_r29]);
		temp_r28->type = -1;
	}
	fn_2_21F8(object);
	object->func = fn_2_33B4;
}

