Rainchus/marioparty4/src/REL/m401Dll/main.c
void fn_2_33B4(omObjData *object)
{
	Hu3DModelPosSet(object->model[3], 110, 5.0*sind(lbl_2_bss_10), -1500);
	lbl_2_bss_10 += 2.0f;
	if(lbl_2_bss_10 >= 360.0f) {
		lbl_2_bss_10 -= 360.0f;
	}
}

void fn_2_9E28(float arg1, float arg2);

void fn_2_34B8(omObjData *object)
{
	Vec sp8;
	Work2FA4 *temp_r31;
	s32 temp_r30;
	s32 temp_r28;
	temp_r31 = object->data;
	if(lbl_2_bss_60.z < -5000.0f && temp_r31->unk0 == 0) {
		temp_r31->unk0 = 1;
		fn_2_9E28(-15500, -20000);
	}
	if(lbl_2_bss_6C.z <= lbl_2_data_A0[lbl_2_bss_C]) {
		lbl_2_bss_C++;
		lbl_2_data_CC[lbl_2_bss_C][0](object);
	}
	if(lbl_2_bss_6C.z <= lbl_2_data_B4[lbl_2_bss_E]) {
		lbl_2_data_CC[lbl_2_bss_E][1](object);
		lbl_2_bss_E++;
	}
	if(lbl_2_bss_6C.z <= -40000.0f) {
		lbl_2_bss_BE = 1;
	}
	if(temp_r31->unk2C) {
		temp_r31->unk2C--;
	} else {
		temp_r31->unk2C = 274;
		if(lbl_2_bss_60.z > -31260.0f) {
			temp_r28 = 4;
			for(temp_r30=0; temp_r30<temp_r28; temp_r30++) {
				sp8.x = -340.0f+((1.0f/255.0f)*(680.0f*(u32)frand8()));
				sp8.y = -250.0f+((1.0f/255.0f)*(500.0f*(u32)frand8()));
				sp8.z = ((-4000.0f-(temp_r30*240))-40.0f)+((1.0f/255.0f)*(80.0f*(u32)frand8()));
				fn_2_10A88(&sp8, 0);
			}
		}
	}
}

void fn_2_3838(omObjData *object)
{
	Work2FA4 *temp_r31;
	s32 temp_r29;
	float temp_f31;
	temp_r31 = object->data;
	temp_r31->unk4 = 5.0*sind(temp_r31->unk8.x);
	temp_r31->unk8.y += temp_r31->unk8.z;
	Hu3DModelPosSet(object->model[4], temp_r31->unk8.y, temp_r31->unk4, 0);
	Hu3DModelPosSet(object->model[5], temp_r31->unk8.y, 0, 0);
	Hu3DModelScaleSet(object->model[5], 1.0f-(0.09f*(temp_r31->unk4/5.0f)), 1.0f, 1.0f-(0.09f*(temp_r31->unk4/5.0f)));
	for(temp_r29=0; temp_r29<2; temp_r29++) {
		temp_f31 = temp_r31->unk14[temp_r29].y+(5.0*sind(temp_r31->unk8.x));
		temp_r31->unk14[temp_r29].x += temp_r31->unk8.z;
		Hu3DModelPosSet(object->model[temp_r29+9], temp_r31->unk14[temp_r29].x, temp_f31, temp_r31->unk14[temp_r29].z);
	}
	Hu3DModelPosSet(object->model[11], temp_r31->unk14[0].x, temp_f31, temp_r31->unk14[0].z);
	temp_r31->unk8.z *= 1.04f;
	if(temp_r31->unk8.z > 12.0f) {
		temp_r31->unk8.z = 12.0f;
	}
	temp_r31->unk8.x += 2.0f;
	if(temp_r31->unk8.x >= 360.0f) {
		temp_r31->unk8.x -= 360.0f;
	}
	lbl_2_data_30.x = temp_r31->unk8.y;
	lbl_2_data_48.x = temp_r31->unk8.y;
	Hu3DShadowPosSet(&lbl_2_data_30, &lbl_2_data_3C, &lbl_2_data_48);
}

void fn_2_3F28(omObjData *object);

s32 lbl_2_data_158[][10] = {
	0x005F002A, 
	0x00200031,
	0x005F0000,
	0x005F002B,
	0x005F0005,
	0x005F0017,
	0x00200039,
	0x00200041,
	0x005F0022,
	0x00200049,
	0x001A002A, 
	0x00200032,
	0x001A0000,
	0x001A002B,
	0x001A0005,
	0x001A0017,
	0x0020003A,
	0x00200042,
	0x001A0022,
	0x0020004A,
	0x006D002A, 
	0x00200033,
	0x006D0000,
	0x006D002B,
	0x006D0005,
	0x006D0017,
	0x0020003B,
	0x00200043,
	0x006D0022,
	0x0020004B,
	0x008A002A, 
	0x00200034,
	0x008A0000,
	0x008A002B,
	0x008A0005,
	0x008A0017,
	0x0020003C,
	0x00200044,
	0x008A0022,
	0x0020004C,
	0x0085002A, 
	0x00200035,
	0x00850000,
	0x0085002B,
	0x00850005,
	0x00850017,
	0x0020003D,
	0x00200045,
	0x00850022,
	0x0020004D,
	0x0011002A, 
	0x00200036,
	0x00110000,
	0x0011002B,
	0x00110005,
	0x00110017,
	0x0020003E,
	0x00200046,
	0x00110022,
	0x0020004E,
	0x000D002A, 
	0x00200037,
	0x000D0000,
	0x000D002B,
	0x000D0005,
	0x000D0017,
	0x0020003F,
	0x00200047,
	0x000D0022,
	0x0020004F,
	0x0081002A, 
	0x00200038,
	0x00810000,
	0x0081002B,
	0x00810005,
	0x00810017,
	0x00200040,
	0x00200048,
	0x00810022,
	0x00200050,
};

Vec lbl_2_data_298[] = {
	-150, 1250, -1400,
	-50, 1250, -1400,
	50, 1250, -1400,
	150, 1250, -1400,
};

Vec lbl_2_data_2C8[] = {
	-300, 0, -1500,
	-100, 0, -1500,
	100, 0, -1500,
	300, 0, -1500,
};

void fn_2_3F28(omObjData *object);

void fn_2_3B24(omObjData *object)
{
	M401WorkPlayer *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	s32 temp_r27;
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(M401WorkPlayer), MEMORY_DEFAULT_NUM);
	temp_r31 = object->data;
	temp_r29 = object->work[0];
	temp_r31->unk4 = temp_r29;
	temp_r31->unk8 = GWPlayerCfg[temp_r29].pad_idx;
	temp_r27 = GWPlayerCfg[temp_r29].character;
	temp_r31->unk86 = lbl_2_data_4[temp_r27];
	object->model[0] = CharModelCreate(temp_r31->unk86, 4);
	if(temp_r29 == 0) {
		object->model[2] = Hu3DModelCreateFile(0x200025);
		object->model[3] = Hu3DModelCreateFile(0x200027);
	} else {
		object->model[2] = Hu3DModelLink(lbl_2_bss_118[0]->model[2]);
		object->model[3] = Hu3DModelCreateFile(0x200027);
	}
	Hu3DModelAttrSet(object->model[3], 0x40000002);
	Hu3DModelClusterAttrSet(object->model[3], 0, 0xC0000002);
	Hu3DModelLayerSet(object->model[3], 7);
	for(temp_r28=0; temp_r28<10; temp_r28++) {
		object->motion[temp_r28] = CharModelMotionCreate(lbl_2_data_4[temp_r27], lbl_2_data_158[temp_r27][temp_r28]);
	}
	CharModelMotionSet(temp_r31->unk86, object->motion[2]);
	Hu3DModelAttrSet(object->model[0], 0x40000001);
	Hu3DModelAttrSet(object->model[2], 1);
	Hu3DModelAttrSet(object->model[2], 0x40000001);
	Hu3DModelLayerSet(object->model[2], 2);
	Hu3DModelAmbSet(object->model[0], 1, 1, 1);
	Hu3DModelShadowSet(object->model[0]);
	CharModelVoiceEnableSet(lbl_2_data_4[temp_r27], object->motion[4], 0);
	temp_r31->unkC = lbl_2_data_2C8[temp_r29];
	temp_r31->unk58.z = 0;
	omSetTra(object, lbl_2_data_298[temp_r29].x, lbl_2_data_298[temp_r29].y, lbl_2_data_298[temp_r29].z);
	temp_r31->unk0 = 0;
	temp_r31->unk6E = 70;
	temp_r31->unk24.x = lbl_2_data_2C8[temp_r29].x;
	temp_r31->unk24.y = lbl_2_data_2C8[temp_r29].y;
	temp_r31->unk24.z = 800+lbl_2_data_2C8[temp_r29].z;
	temp_r31->unk6A = 0;
	temp_r31->unk72 = 0;
	temp_r31->unk74 = 0;
	temp_r31->unk78 = 0;
	temp_r31->unk7A = 0;
	temp_r31->unk7C = 0;
	temp_r31->unk76 = 0;
	temp_r31->unk88 = 0;
	temp_r31->unk84 = 0;
	temp_r31->unk8C = 0;
	temp_r31->unk8E = 0;
	temp_r31->unk94.x = temp_r31->unk94.y = temp_r31->unk94.z = 0;
	temp_r31->unk90 = 0;
	temp_r31->unkA0 = temp_r31->unkA1 = 0;
	CharModelMotionDataClose(temp_r31->unk86);
	object->func = fn_2_3F28;
}

void fn_2_6B44(omObjData *object);
void fn_2_D3E8(omObjData *object);

void fn_2_3F28(omObjData *object)
{
	Vec sp28;
	Vec sp1C;
	Vec sp10;
	M401WorkPlayer *temp_r31;
	CameraData *temp_r29;
	omObjData *temp_r28;
	UnkWork10A88 *temp_r27;
	float temp_f27;
	temp_r31 = object->data;
	switch(temp_r31->unk0) {
		case 0:
			if(--temp_r31->unk6E == 0) {
				temp_r31->unk0 = 1;
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[4], 0, 20, 0);
				temp_r31->unk58.x = 16;
				temp_r31->unk58.y = 0;
			}
			break;
			
		case 1:
			if(object->trans.y < 1100) {
				temp_r31->unk0 = 2;
				temp_f27 = VECMagPoint(object->trans.x-temp_r31->unk24.x, object->trans.y-temp_r31->unk24.y, object->trans.z-temp_r31->unk24.z);
				temp_r31->unk58.z = temp_f27;
				temp_r31->unk58.y = 0;
				temp_r31->unk6E = 110;
				temp_r28 = fn_2_10A88(&lbl_2_data_298[temp_r31->unk4], 2);
				temp_r31->unk50 = temp_r28;
				temp_r27 = temp_r28->data;
				temp_r27->unkC = object;
				fn_2_6B44(object);
				temp_r28 = fn_2_10A88(&lbl_2_data_298[temp_r31->unk4], 4);
				temp_r27 = temp_r28->data;
				temp_r27->unkC = object;
				temp_r31->unk4C = temp_r28;
				temp_r28 = fn_2_10A88(&lbl_2_data_298[temp_r31->unk4], 5);
				temp_r27 = temp_r28->data;
				temp_r27->unkC = object;
				temp_r31->unk48 = temp_r28;
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[1], 0, 80, 0x40000001);
				temp_r31->unk30.x = object->trans.x;
				temp_r31->unk30.y = object->trans.y;
				temp_r31->unk30.z = object->trans.z;
				Hu3DModelAttrReset(object->model[3], 1);
				Hu3DModelAttrReset(object->model[3], 0x40000002);
				Hu3DModelClusterAttrReset(object->model[3], 0, 0xC0000002);
				Hu3DModelPosSet(object->model[3], object->trans.x, 100, 100+object->trans.z);
				Hu3DMotionTimeSet(object->model[3], 0);
				if(temp_r31->unk4 == 0) {
					HuAudFXPlay(1281);
				}
				omVibrate(temp_r31->unk4, 12, 4, 2);
			} else {
				object->trans.y += temp_r31->unk58.x-(0.07f*temp_r31->unk58.y*temp_r31->unk58.y);
				object->trans.z += 2.0f;
				temp_r31->unk58.y += 1.0f;
			}
			break;
			
