Rainchus/marioparty4/src/REL/m401Dll/main.c
		case 2:
			temp_r29 = &Hu3DCamera[0];
			sp1C = temp_r31->unk24;
			sp10 = temp_r31->unk30;
			VECSubtract(&sp1C, &sp10, &sp28);
			VECNormalize(&sp28, &sp28);
			object->trans.x = temp_r31->unk30.x+(temp_r31->unk58.z*(sp28.x*sind(temp_r31->unk58.y)));
			object->trans.y = temp_r31->unk30.y+(temp_r31->unk58.z*(sp28.y*sind(temp_r31->unk58.y)));
			object->trans.z = temp_r31->unk30.z+(temp_r31->unk58.z*(sp28.z*sind(temp_r31->unk58.y)));
			temp_r31->unk58.y += 9.0f/11.0f;
			omSetRot(object, atan2d(sp28.y, sp28.z)+90.0, 0, 0);
			temp_f27 = VECMagPoint(object->trans.x-sp1C.x, object->trans.y-sp1C.y, object->trans.z-sp1C.z);
			if(--temp_r31->unk6E == 60 && temp_r31->unk4 == 0 && lbl_2_bss_4 == NULL) {
				temp_r29 = &Hu3DCamera[0];
				lbl_2_bss_4 = omAddObjEx(HuPrcCurrentGet(), 1400, 0, 0, -1, fn_2_D3E8);
				lbl_2_bss_4->trans.x = temp_r29->pos.x;
				lbl_2_bss_4->trans.y = temp_r29->pos.y;
				lbl_2_bss_4->trans.z = temp_r29->pos.z;
				lbl_2_bss_4->rot.x = temp_r29->target.x;
				lbl_2_bss_4->rot.y = temp_r29->target.y;
				lbl_2_bss_4->rot.z = temp_r29->target.z;
				lbl_2_bss_4->scale.x = 0;
			}
			if(temp_r31->unk6E == 0) {
				temp_r31->unk0 = 3;
				temp_r31->unk4C->work[0] = 1;
				temp_r31->unk48->work[0] = 1;
			}
			fn_2_6B44(object);
			break;
			
		case 3:
			sp1C.x = lbl_2_bss_108->trans.x;
			sp1C.y = lbl_2_data_298[temp_r31->unk4].y;
			sp1C.z = lbl_2_bss_108->trans.z;
			sp10.x = object->trans.x;
			sp10.y = object->trans.y;
			sp10.z = object->trans.z;
			VECSubtract(&sp1C, &sp10, &sp28);
			VECNormalize(&sp28, &sp28);
			object->rot.x *= 0.95f;
			if(object->rot.x < 1.0f) {
				object->rot.x = 0.0f;
			}
			omSetRot(object, object->rot.x, atan2d(sp28.x, sp28.z), 0);
			fn_2_6B44(object);
			break;
	}
}

void fn_2_6B44(omObjData *object);

void fn_2_48A0(omObjData *object)
{
	M401WorkPlayer *temp_r31;
	Work2FA4 *temp_r29;
	float temp_f29;
	Vec sp4C;
	Vec sp40;
	s32 sp30[] = { -10, -50, -80, -130 };
	Vec sp24;
	Vec sp18;
	Vec spC;
	temp_r31 = object->data;
	temp_r29 = lbl_2_bss_10C->data;
	if(temp_r31->unk4 == 0) {
		lbl_2_bss_1A--;
	}
	switch(temp_r31->unk0) {
		case 5:
			if(temp_r31->unk6A == 1) {
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[1], 0, 8, 0x40000001);
				temp_r31->unk6A = 0;
			}
			omSetRot(object, 0, 180, 0);
			object->trans.z -= 5.0f;
			fn_2_6B44(object);
			break;
			
		case 6:
			object->trans.y += temp_r31->unk58.x;
			if(object->trans.y >= 910.0f) {
				if(temp_r31->unk6C == 0) {
					temp_r31->unk6C = 1;
					Hu3DModelAttrReset(object->model[2], 1);
					Hu3DModelAttrSet(object->model[2], 0x40000001);
					Hu3DModelPosSet(object->model[2], object->trans.x, 950, 30+object->trans.z);
					Hu3DModelScaleSet(object->model[2], 1, 1, 1);
					Hu3DMotionTimeSet(object->model[2], 0);
					sp4C.x = object->trans.x;
					sp4C.y = 950;
					sp4C.z = 30+object->trans.z;
					fn_2_10A88(&sp4C, 7);
					HuAudFXEmiterPlay(1289, &sp4C);
				}
				temp_r31->unk58.x *= 0.7f;
				if(temp_r31->unk58.x <= 0.5f) {
					temp_r31->unk0 = 7;
					temp_r31->unk58.x = -0.5f;
					CharModelMotionShiftSet(temp_r31->unk86, object->motion[0], 0, 30, 0x40000001);
					temp_r31->unk80 = 0;
					temp_r31->unk6C = 0;
				}
			}
			
			break;
			
		case 7:
			object->trans.y += temp_r31->unk58.x;
			if(object->trans.y <= 890) {
				object->trans.y = 890;
				if(lbl_2_bss_BA) {
					if(temp_r31->unk68) {
						temp_r31->unk0 = 16;
					} else {
						temp_r31->unk0 = 9;
					}
				} else {
					temp_r31->unk0 = 8;
					temp_r29->unk8.z = 0.5f;
					temp_r31->unk6E = 0;
					HuAudSStreamPlay(4);
					lbl_2_bss_C0 = MGSeqDrawCreate();
					lbl_2_bss_1A = 210;
				}
			}
			temp_r31->unk58.x *= 1.17f;
			object->trans.y -= 0.35f*sind(temp_r31->unk80);
			temp_r31->unk80 += 3.0f;
			if(temp_r31->unk80 >= 360.0f) {
				temp_r31->unk80 -= 360.0f;
			}
			break;
			
		case 8:
			object->trans.y -= 0.35f*sind(temp_r31->unk80);
			temp_r31->unk80 += 3.0f;
			if(temp_r31->unk80 >= 360.0f) {
				temp_r31->unk80 -= 360.0f;
			}
			if(temp_r31->unk6E == 13) {
				Hu3DModelAttrReset(lbl_2_bss_10C->model[6], 1);
				Hu3DMotionTimeSet(lbl_2_bss_10C->model[6], 0);
			} else if(temp_r31->unk6E == 50) {
				Hu3DMotionOverlaySet(object->model[0], object->motion[8]);
				Hu3DMotionOverlayTimeSet(object->model[0], 31.0f);
				Hu3DData[object->model[0]].unk_78 = 1;
			}
			if(temp_r31->unk6E >= 70) {
				if(object->rot.y < 90.0f) {
					object->rot.y += 2.25f;
				} else {
					object->rot.y = 90.0f;
				}
			}
			temp_r31->unk6E++;
			if(temp_r29->unk8.y >= 1500.0f) {
				temp_r29->unk8.z = 0;
				if(temp_r31->unk4 == 0) {
					temp_r31->unk0 = 14;
				}
			}
			break;
			
		case 16:
			if(!temp_r31->unk6C) {
				temp_r31->unk6C = 1;
				HuAudPlayerVoicePlay(temp_r31->unk4, 292);
				Hu3DMotionOverlaySet(object->model[0], object->motion[9]);
				if(temp_r31->unk4 == lbl_2_bss_B2[0]) {
					HuAudSStreamPlay(1);
					lbl_2_bss_C0 = MGSeqWinCreate(lbl_2_bss_AA[0], lbl_2_bss_AA[1], lbl_2_bss_AA[2], lbl_2_bss_AA[3]);
					lbl_2_bss_1A = 210;
					temp_r31->unk6E = 160;
					temp_r31->unk0 = 13;
				}
			}
			temp_r31->unk58.x *= 1.17f;
			object->trans.y -= 0.35f*sind(temp_r31->unk80);
			temp_r31->unk80 += 3.0f;
			if(temp_r31->unk80 >= 360.0f) {
				temp_r31->unk80 -= 360.0f;
			}
			if(73.0f <= Hu3DMotionOverlayTimeGet(object->model[0])) {
				Hu3DMotionOverlayTimeSet(object->model[0], 35.0f);
			}
			break;
			
		case 10:
			object->trans.y += temp_r31->unk58.x;
			if(object->trans.y >= 910.0f) {
				if(temp_r31->unk6C == 0) {
					temp_r31->unk6C = 1;
					omVibrate(temp_r31->unk4, 12, 4, 2);
					Hu3DModelAttrReset(object->model[2], 1);
					Hu3DModelAttrReset(object->model[2], 0x40000002);
					Hu3DModelAttrSet(object->model[2], 0x40000001);
					Hu3DModelPosSet(object->model[2], object->trans.x, 950, 30+object->trans.z);
					Hu3DModelScaleSet(object->model[2], 1, 1, 1);
					Hu3DMotionTimeSet(object->model[2], 0);
					Hu3DModelAttrReset(object->model[3], 0x40000002);
					Hu3DModelAttrReset(object->model[3], 1);
					Hu3DModelClusterAttrReset(object->model[3], 0, 0xC0000002);
					Hu3DModelPosSet(object->model[3], object->trans.x, 0, 30+object->trans.z);
					Hu3DMotionTimeSet(object->model[3], 0);
					sp4C.x = object->trans.x;
					sp4C.y = 950;
					sp4C.z = 30+object->trans.z;
					fn_2_10A88(&sp4C, 7);
					HuAudFXEmiterPlay(1289, &sp4C);
				}
				temp_r31->unk0 = 11;
				temp_r31->unk24.x = sp30[temp_r31->unk4];
				temp_r31->unk24.y = 1030;
				temp_r31->unk24.z = 40;
				sp4C.x = object->trans.x;
				sp4C.y = object->trans.y;
				sp4C.z = object->trans.z;
				VECSubtract(&temp_r31->unk24, &sp4C, &sp40);
				VECNormalize(&sp40, &sp40);
				temp_f29 = VECDistanceXZ(&temp_r31->unk24, &object->trans);
				temp_r31->unk30.x = (sp40.x*temp_f29)/60.0f;
				temp_r31->unk30.z = (sp40.z*temp_f29)/60.0f;
				temp_r31->unk30.y = 18.75f;
				temp_r31->unk58.y = 0;
			}
			break;
			
		case 11:
			temp_f29 = temp_r31->unk30.y-(0.020833334f*temp_r31->unk58.y*temp_r31->unk58.y);
			object->trans.x += temp_r31->unk30.x;
			object->trans.z += temp_r31->unk30.z;
			object->trans.y += temp_f29;
			temp_r31->unk58.y += 1.0f;
			if(object->trans.y <= 1030.0f && temp_f29 < 0) {
				temp_r31->unk0 = 12;
				object->trans.y = 1030+temp_r29->unk4;
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[2], 0, 15, 0x40000001);
				temp_r31->unk58.x =  0;
			}
			break;
			
