Rainchus/marioparty4/src/REL/m401Dll/main.c
		case 12:
			object->trans.y = 1030+temp_r29->unk4;
			sp24.x = (sind(temp_r31->unk58.x), 0.0);
			sp24.y = -100*sind(temp_r31->unk58.x)+1300;
			sp24.z = -500*sind(temp_r31->unk58.x)+1300;
			sp18.x = (sind(temp_r31->unk58.x), 0.0);
			sp18.y = 330*sind(temp_r31->unk58.x)+920;
			sp18.z = (sind(temp_r31->unk58.x), 0.0) + -100.0;
			spC.x = 0;
			spC.y = 1;
			spC.z = 0;
			Hu3DCameraPosSetV(1, &sp24, &spC, &sp18);
			temp_r31->unk58.x += 3.0f;
			if(temp_r31->unk58.x > 90.0f) {
				temp_r31->unk0 = 13;
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[5], 0, 20, 0);
				HuAudSStreamPlay(1);
				lbl_2_bss_C0 = MGSeqWinCreate(lbl_2_bss_AA[0], -1, -1, -1);
				lbl_2_bss_1A = 210;
			}
			temp_r31->unk6E = 160;
			break;
			
		case 13:
			if(lbl_2_bss_BA == 1) {
				object->trans.y = 1030+temp_r29->unk4;
			} else {
				temp_r31->unk58.x *= 1.17f;
				object->trans.y -= 0.35f*sind(temp_r31->unk80);
				temp_r31->unk80 += 3.0f;
				if(temp_r31->unk80 >= 360.0f) {
					temp_r31->unk80 -= 360.0f;
				}
				if(73.0f <= Hu3DMotionOverlayTimeGet(object->model[0])) {
					Hu3DMotionOverlayTimeSet(object->model[0], 35.0f);
				}
			}
			if(--temp_r31->unk6E == 0) {
				temp_r31->unk0 = 14;
			}
			
			break;
			
		case 14:
			if(temp_r31->unk68) {
				if(lbl_2_bss_BA == 1) {
					object->trans.y = 1030+temp_r29->unk4;
				} else {
					temp_r31->unk58.x *= 1.17f;
					object->trans.y -= 0.35f*sind(temp_r31->unk80);
					temp_r31->unk80 += 3.0f;
					if(temp_r31->unk80 >= 360.0f) {
						temp_r31->unk80 -= 360.0f;
					}
					if(73.0f <= Hu3DMotionOverlayTimeGet(object->model[0])) {
						Hu3DMotionOverlayTimeSet(object->model[0], 35.0f);
					}
				}
			}
			if(lbl_2_bss_1A <= 0) {
				WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
				HuAudSeqFadeOut(lbl_2_bss_A4, 100);
				HuAudFXStop(lbl_2_bss_11C);
				temp_r31->unk0 = 15;
			}
			break;
			
		case 15:
			if(temp_r31->unk68) {
				if(lbl_2_bss_BA == 1) {
					object->trans.y = 1030+temp_r29->unk4;
				} else {
					temp_r31->unk58.x *= 1.17f;
					object->trans.y -= 0.35f*sind(temp_r31->unk80);
					temp_r31->unk80 += 3.0f;
					if(temp_r31->unk80 >= 360.0f) {
						temp_r31->unk80 -= 360.0f;
					}
					if(73.0f <= Hu3DMotionOverlayTimeGet(object->model[0])) {
						Hu3DMotionOverlayTimeSet(object->model[0], 35.0f);
					}
				}
			}
			if(!WipeStatGet()) {
				lbl_2_bss_110->func = fn_2_A10;
			}
			break;
	}
}

void fn_2_65FC(omObjData *object);
void fn_2_6AF4(omObjData *object);
void fn_2_A940(omObjData *object);

void fn_2_6C94(omObjData *object, s8 *x, s8 *y, u16 *btn);

void fn_2_5CC0(omObjData *object)
{
	M401WorkPlayer *temp_r31;
	float temp_f29;
	Vec sp20;
	Vec sp14;
	s32 sp10;
	u16 spA;
	s8 sp9;
	s8 sp8;
	temp_f29 = 0;
	temp_r31 = object->data;
	sp9 = sp8 = spA = 0;
	if(temp_r31->unk78 == 0) {
		if(GWPlayerCfg[temp_r31->unk4].iscom) {
			fn_2_6C94(object, &sp9, &sp8, &spA);
		} else {
			sp9 = HuPadStkX[temp_r31->unk8];
			sp8 = HuPadStkY[temp_r31->unk8];
			spA = HuPadBtnDown[temp_r31->unk8];
		}
		if(sp9 != 0 || sp8 != 0) {
			temp_r31->unk58.z = sqrtf((sp9*sp9)+(sp8*sp8))/9.0f;
		}
		temp_r31->unk64 = atan2d(sp9, sp8);
		if(spA & PAD_BUTTON_A) {
			temp_r31->unk88 += 1.51f*lbl_2_data_0;
			if(temp_r31->unk88 < 1.51f*lbl_2_data_0) {
				temp_r31->unk88 = 1.51f*lbl_2_data_0;
			}
		}
		if(temp_r31->unk88 >= 0.0f){ 
			temp_f29 = 0;
		} else {
			temp_f29 = fabs(temp_r31->unk88/(1.51f*lbl_2_data_0));
		}
		if(temp_r31->unk84) {
			if(--temp_r31->unk84 == 0) {
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[1], 0, 8, 0x40000001);
				temp_r31->unk6A = 0;
			}
		}
	} else {
		temp_r31->unk84 = 0;
		if(--temp_r31->unk7A == 0) {
			sp10 = GWPlayerCfg[temp_r31->unk4].character;
			CharModelMotionShiftSet(temp_r31->unk86, object->motion[1], 0, 8, 0x40000001);
			temp_r31->unk78 = 0;
			temp_r31->unk6A = 0;
		}
		if(temp_r31->unk7A & 0x1) {
			Hu3DModelAttrSet(object->model[0], 1);
		} else {
			Hu3DModelAttrReset(object->model[0], 1);
		}
	}
	if(temp_f29 != 0) {
		if(++temp_r31->unk8C > 15) {
			temp_r31->unk8C  = 15;
		}
		temp_r31->unk8E = 0;
	} else {
		if(++temp_r31->unk8E > 5) {
			temp_r31->unk8E = 5;
			temp_r31->unk8C = 0;
		}
	}
	if(temp_r31->unk78 == 0 && temp_r31->unk84 == 0) {
		if(temp_r31->unk58.z > 0 || temp_r31->unk8C >= 5) {
			if(temp_r31->unk6A == 0) {
				temp_r31->unk6A = 1;
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[3], 0, 8, 0x40000001);
			}
		} else {
			if(temp_r31->unk6A == 1) {
				CharModelMotionShiftSet(temp_r31->unk86, object->motion[1], 0, 8, 0x40000001);
				temp_r31->unk6A = 0;
			}
		}
	}
	CharModelMotionSpeedSet(temp_r31->unk86, 1.0f+temp_f29);
	fn_2_65FC(object);
	if(temp_r31->unk58.z > 0.1f) {
		temp_r31->unk58.z *= 0.9f;
	} else {
		temp_r31->unk58.z = 0.0f;
	}
	temp_r31->unk88 -= 0.15f*lbl_2_data_0;
	if(temp_r31->unk88 > -lbl_2_data_0) {
		temp_r31->unk88 = -lbl_2_data_0;
	}
	sp20.x = object->trans.x;
	sp20.y = object->trans.y;
	sp20.z = object->trans.z;
	omSetTra(object, temp_r31->unkC.x, temp_r31->unkC.y, lbl_2_bss_60.z+temp_r31->unkC.z);
	sp14.x = object->trans.x;
	sp14.y = object->trans.y;
	sp14.z = object->trans.z;
	if(sp8 != 0) {
		object->rot.x -= 0.05f*sp8;
	} else {
		object->rot.x *= 0.8f;
		if(object->rot.x < 0.01f) {
			object->rot.x = 0;
		}
	}
	if(sp9 != 0) {
		object->rot.z -= 0.05f*sp9;
	} else {
		object->rot.z *= 0.8f;
		if(object->rot.z < 0.01f) {
			object->rot.z = 0;
		}
	}
	if(object->rot.x < -30.0f) {
		object->rot.x = -30.0f;
	}
	if(object->rot.x > 30.0f) {
		object->rot.x = 30.0f;
	}
	if(object->rot.z < -30.0f) {
		object->rot.z = -30.0f;
	}
	if(object->rot.z > 30.0f) {
		object->rot.z = 30.0f;
	}
	object->rot.y = 180;
	fn_2_6AF4(object);
	fn_2_A940(object);
	temp_r31->unk70 = 0;
}

void fn_2_65FC(omObjData *object)
{
	M401WorkPlayer *temp_r31;
	M401WorkPlayer *temp_r30;
	s32 temp_r29;
	omObjData *temp_r28;
	float temp_f31;
	float temp_f30;
	float temp_f29;
	float temp_f26;
	float temp_f24;
	
	Vec sp24;
	Vec sp18;
	Vec spC;
	temp_r30 = object->data;
	temp_f26 = temp_r30->unk58.z;
	sp24.x = sind(temp_r30->unk64);
	sp24.y = cosd(temp_r30->unk64);
	sp24.z = temp_r30->unk88+lbl_2_data_0;
	VECNormalize(&sp24, &sp18);
	sp24.x *= temp_f26;
	sp24.y *= temp_f26;
	sp24.z -= lbl_2_data_0;
	temp_f31 = temp_r30->unkC.x+sp24.x;
	temp_f30 = temp_r30->unkC.y+sp24.y;
	temp_f29 = temp_r30->unkC.z+sp24.z;
	if(temp_f31 < -400) {
		temp_f31 = -400;
	}
	if(temp_f31 > 400) {
		temp_f31 = 400;
	}
	if(temp_f30 < -300) {
		temp_f30 = -300;
	}
	if(temp_f30 > 300) {
		temp_f30 = 300;
	}
	if(temp_f29 < 400) {
		temp_f29 = 400;
	}
	if(temp_f29 > 800) {
		temp_f29 = 800;
	}
	for(temp_r29=0; temp_r29<4; temp_r29++) {
		if(lbl_2_bss_118[temp_r29] != object) {
			temp_r28 = lbl_2_bss_118[temp_r29];
			temp_r31 = temp_r28->data;
			temp_f24 = VECMagPoint(temp_f31-temp_r31->unkC.x, temp_f30-temp_r31->unkC.y, temp_f29-temp_r31->unkC.z);
			if(temp_f24 < 127.0f) {
				spC.x = temp_f31-temp_r31->unkC.x;
				spC.y = temp_f30-temp_r31->unkC.y;
				spC.z = temp_f29-temp_r31->unkC.z;
				VECNormalize(&spC, &spC);
				temp_f31 = temp_r31->unkC.x+127.0f*spC.x;
				temp_f30 = temp_r31->unkC.y+127.0f*spC.y;
				temp_f29 = temp_r31->unkC.z+127.0f*spC.z;
			}
		}
	}
	if(temp_f31 < -400) {
		temp_f31 = -400;
	}
	if(temp_f31 > 400) {
		temp_f31 = 400;
	}
	if(temp_f30 < -300) {
		temp_f30 = -300;
	}
	if(temp_f30 > 300) {
		temp_f30 = 300;
	}
	if(temp_f29 < 400) {
		temp_f29 = 400;
	}
	if(temp_f29 > 800) {
		temp_f29 = 800;
	}
	temp_r30->unkC.x = temp_f31;
	temp_r30->unkC.y = temp_f30;
	temp_r30->unkC.z = temp_f29;
}

void fn_2_6AF4(omObjData *object)
{
	M401WorkPlayer *temp_r31 = object->data;
	temp_r31->unk18.x = temp_r31->unkC.x+lbl_2_bss_60.x;
	temp_r31->unk18.y = object->trans.y;
	temp_r31->unk18.z = 80+object->trans.z;
}

void fn_2_6B44(omObjData *object)
{
	M401WorkPlayer *temp_r30;
	float temp_f31;
	float temp_f30;
	float temp_f29;
	temp_r30 = object->data;
	temp_f31 = 80.0*sind(object->rot.y+180.0f);
	temp_f29 = 80.0*-cosd(object->rot.y);
	temp_f30 = 80.0*sind(object->rot.x);
	temp_r30->unk18.x = object->trans.x+temp_f31;
	temp_r30->unk18.y = object->trans.y+temp_f30;
	temp_r30->unk18.z = object->trans.z+temp_f29;
}

