Rainchus/marioparty4/src/REL/m401Dll/main.c
omObjData *fn_2_792C(omObjData *object);

void fn_2_6C94(omObjData *object, s8 *x, s8 *y, u16 *btn)
{
	M401WorkPlayer *temp_r31;
	s32 temp_r30;
	omObjData *temp_r28;
	s32 temp_r27;
	u16 temp_r26 = 0;
	float temp_f31;
	float temp_f30;
	float temp_f29;
	s16 sp50[][8] = {
		0, 2, 0, 2, 0, 2, 0, 2,
		0, 2, 0, 2, 0, 0, 0, 2,
		0, 0, 0, 2, 0, 0, 0, 2,
		0, 0, 0, 0, 0, 0, 0, 0,
	};
	Vec sp44;
	Vec sp38;
	Vec sp2C;
	Vec sp20;
	s16 sp18[] = {
		50, 125, 200, 245
	};
	s16 sp10[] = {
		75, 150, 200, 250
	};
	s16 sp8[] = {
		9, 6, 4, 2
	};
	temp_r31 = object->data;
	*x = *y = 0;
	*btn = 0;
	if(temp_r31->unk7C == 0) {
		temp_r31->unk7E = sp50[GWPlayerCfg[temp_r31->unk4].diff][frand() & 0x7];
		temp_r31->unk7C = (frand()%60)+30;
		temp_r31->unk92 = 0;
		if((u32)frand8() < sp18[GWPlayerCfg[temp_r31->unk4].diff]) {
			temp_r31->unk92 |= 1;
		}
		if((u32)frand8() < sp10[GWPlayerCfg[temp_r31->unk4].diff]) {
			temp_r31->unk92 |= 2;
		}
	} else {
		temp_r31->unk7C--;
	}
	temp_r26 = temp_r31->unk92;
	sp44.x = sp44.y = sp44.z = 0;
	switch(temp_r31->unk7E) {
		case 0:
			temp_r28 = fn_2_792C(object);
			if(temp_r28) {
				sp44.x = temp_r28->trans.x-object->trans.x;
				sp44.y = temp_r28->trans.y-object->trans.y;
				sp44.z = temp_r28->trans.z-object->trans.z;
			}
			break;
			
		case 2:
			break;
	}
	if(temp_r26 & 0x1) {
		sp38.x = object->trans.x;
		sp38.y = object->trans.y;
		sp38.z = object->trans.z;
		for(temp_r27=0; temp_r27<4; temp_r27++) {
			if(lbl_2_bss_118[temp_r27] != object) {
				sp20.x = lbl_2_bss_118[temp_r27]->trans.x;
				sp20.y = lbl_2_bss_118[temp_r27]->trans.y;
				sp20.z = lbl_2_bss_118[temp_r27]->trans.z;
				VECSubtract(&sp38, &sp20, &sp2C);
				temp_f31 = VECMag(&sp2C)-110.0f;
				if(temp_f31 < 110.0f) {
					temp_f31 -= 60.0f;
					if(temp_f31 < 0.01f) {
						temp_f31 = 0.01;
					}
					VECScale(&sp2C, &sp2C, 1.0f/temp_f31);
					VECAdd(&sp44, &sp2C, &sp44);
				}
			}
		}
	}
	if(temp_r26 & 0x2) {
		for(temp_r30=0; temp_r30<4; temp_r30++) {
			if(lbl_2_bss_E4[temp_r30]->func != NULL) {
				sp20.x = lbl_2_bss_E4[temp_r30]->trans.x;
				sp20.y = lbl_2_bss_E4[temp_r30]->trans.y;
				sp20.z = lbl_2_bss_E4[temp_r30]->trans.z;
				VECSubtract(&sp38, &sp20, &sp2C);
				temp_f31 = VECMag(&sp2C)-110.0f;
				if(temp_f31 < 110.0f) {
					temp_f31 -= 60.0f;
					if(temp_f31 < 0.01f) {
						temp_f31 = 0.01;
					}
					VECScale(&sp2C, &sp2C, 1.0f/temp_f31);
					VECAdd(&sp44, &sp2C, &sp44);
				}
			}
		}
		for(temp_r30=0; temp_r30<2; temp_r30++) {
			if(lbl_2_bss_100[temp_r30]->func != NULL) {
				sp20.x = lbl_2_bss_100[temp_r30]->trans.x;
				sp20.y = lbl_2_bss_100[temp_r30]->trans.y;
				sp20.z = lbl_2_bss_100[temp_r30]->trans.z;
				VECSubtract(&sp38, &sp20, &sp2C);
				temp_f31 = VECMag(&sp2C)-110.0f;
				if(temp_f31 < 110.0f) {
					temp_f31 -= 60.0f;
					if(temp_f31 < 0.01f) {
						temp_f31 = 0.01;
					}
					VECScale(&sp2C, &sp2C, 1.0f/temp_f31);
					VECAdd(&sp44, &sp2C, &sp44);
				}
			}
		}
		sp20.x = lbl_2_bss_FC->trans.x;
		sp20.y = lbl_2_bss_FC->trans.y;
		sp20.z = lbl_2_bss_FC->trans.z;
		VECSubtract(&sp38, &sp20, &sp2C);
		sp2C.x = 0;
		temp_f31 = VECMag(&sp2C)-220.0f;
		if(temp_f31 < 220.0f) {
			temp_f31 -= 160.0f;
			if(temp_f31 < 0.01f) {
				temp_f31 = 0.01;
			}
			VECScale(&sp2C, &sp2C, 1.0f/temp_f31);
			VECAdd(&sp44, &sp2C, &sp44);
		}
	}
	
	if(sp44.z < 0.0f) {
		if(temp_r31->unk90 == 0) {
			*btn |= 0x100;
			temp_r31->unk90 = (frand()%sp8[GWPlayerCfg[temp_r31->unk4].diff])+3;
		} else {
			temp_r31->unk90--;
		}
	}
	sp44.z = 0;
	temp_f30 = VECMag(&sp44);
	temp_f30 *= 0.2f;
	temp_f29 = atan2d(sp44.y, sp44.x);
	if(temp_f30 > 72.0f) { 
		temp_f30 = 72.0f;
	}
	if(temp_f30 < 10.0f) { 
		temp_f30 = 0.0f; 
	}
	*x = temp_f30*cosd(temp_f29);
	*y = temp_f30*sind(temp_f29);
}

s32 fn_2_AC2C(Vec *pos, float dist, omObjData **newobj);

s32 fn_2_7640(omObjData *object, omObjData **newobj)
{
	Vec spC;
	spC.x = object->trans.x;
	spC.y = object->trans.y;
	spC.z = object->trans.z-100.0f;
	return fn_2_AC2C(&spC, 270.0f, newobj);
}

void fn_2_76AC(omObjData *object, s32 arg1)
{
	M401WorkPlayer *temp_r31;
	if(arg1) {
		temp_r31 = object->data;
		temp_r31->unk7E = 1;
		temp_r31->unk7C = 5;
		switch(arg1) {
			case 1:
				temp_r31->unk80 = 180.0+atan2d(temp_r31->unk54->trans.x-object->trans.x, temp_r31->unk54->trans.y-object->trans.y);
				break;
				
			case 2:
				if(temp_r31->unkC.y > temp_r31->unk54->trans.y) {
					temp_r31->unk80 = 80.0f+((1.0f/255.0f)*(20.0f*(u32)frand8()));
				} else {
					temp_r31->unk80 = 260.0f+((1.0f/255.0f)*(20.0f*(u32)frand8()));
				}
				break;
				
			case 3:
				if(temp_r31->unkC.y > temp_r31->unk54->trans.y) {
					temp_r31->unk80 = 80.0f+((1.0f/255.0f)*(20.0f*(u32)frand8()));
				} else {
					temp_r31->unk80 = 260.0f+((1.0f/255.0f)*(20.0f*(u32)frand8()));
				}
				break;
		}
	}
}

omObjData *fn_2_792C(omObjData *object)
{
	omObjData **temp_r31;
	s32 temp_r30;
	omObjData *temp_r28;
	float temp_f31, temp_f30, temp_f29;
	float temp_f27, temp_f26;
	temp_r31 = omGetGroupMemberListEx(HuPrcCurrentGet(), 1);
	temp_f26 = 100000;
	temp_r28 = NULL;
	for(temp_r30=0; temp_r30<28; temp_r30++) {
		if(temp_r31[temp_r30] == NULL || temp_r31[temp_r30]->trans.z-lbl_2_bss_60.z > 850.0f || temp_r31[temp_r30]->trans.z-lbl_2_bss_60.z < -2500.0f) {
			continue;
		}
		temp_f30 = temp_r31[temp_r30]->trans.x-object->trans.x;
		temp_f29 = temp_r31[temp_r30]->trans.y-object->trans.y;
		temp_f31 = temp_r31[temp_r30]->trans.z-object->trans.z;
		temp_f31 *= 0.15f;
		temp_f27 = VECMagPoint(temp_f30, temp_f29, temp_f31);
		if(temp_f27 < temp_f26 && temp_f27 < 2000.0f) {
			temp_f26 = temp_f27;
			temp_r28 = temp_r31[temp_r30];
		}
	}
	return temp_r28;
}

void fn_2_A914(s32 player);

void fn_2_7C3C(omObjData *object)
{
	M401WorkPlayer *temp_r31 = object->data;
	temp_r31->unk78 = 1;
	temp_r31->unk7A = 120;
	CharModelMotionShiftSet(temp_r31->unk86, object->motion[7], 0, 10, 0);
	fn_2_A914(temp_r31->unk4);
}

typedef struct work_7CB4 {
	s16 unk0;
	Vec unk4;
	Vec unk10;
	s16 unk1C;
	s16 unk1E;
	s16 unk20;
	s16 unk22;
	s16 unk24;
	float unk28;
	s16 unk2C;
	s16 unk2E;
	float unk30;
} Work7CB4;

void fn_2_7E6C(omObjData *object);

void fn_2_7CB4(omObjData *object)
{
	Work7CB4 *temp_r31;
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work7CB4), MEMORY_DEFAULT_NUM);
	temp_r31 = object->data;
	temp_r31->unk10.x = 0;
	temp_r31->unk10.y = 200;
	temp_r31->unk10.z = 0;
	temp_r31->unk1E = 0;
	temp_r31->unk22 = 100;
	temp_r31->unk4.x = 0;
	temp_r31->unk4.y = 200;
	temp_r31->unk24 = 0;
	temp_r31->unk28 = 0;
	object->model[0] = Hu3DModelCreateFile(0x20000B);
	Hu3DModelClusterAttrSet(object->model[0], 0, 0xC0000001);
	Hu3DModelAttrSet(object->model[0], 0x1);
	Hu3DModelAmbSet(object->model[0], 0.6f, 0.6f, 0.6f);
	Hu3DModelShadowSet(object->model[0]);
	temp_r31->unk0 = 0;
	temp_r31->unk22 = 180;
	omSetTra(object, 0, 200, 200);
	omSetRot(object, 0, 180, 0);
	object->func = fn_2_7E6C;
}

void fn_2_7E6C(omObjData *object)
{
	Work7CB4 *temp_r31;
	temp_r31 = object->data;
	switch(temp_r31->unk0) {
		case 0:
			if(--temp_r31->unk22 == 0) {
				temp_r31->unk0 = 1;
			}
			break;
			
		case 1:
			object->trans.z += -11.333333f;
			break;
	}
}

s32 gap_04_00000328_data = 0x20000C;
s32 lbl_2_data_32C[] = {
	4, 6
};
Vec lbl_2_data_334[][10] = {
	{
		{ 1400, -600, -21500 },
		{ -100, 100, -22000 },
		{ -1000, -200, -23000 },
		{ -2000, -200, -23500 },
		{ -2200, -200, -23500 },
		{ -2300, -200, -23500 },
	},
	{
		{ -1000, 500, -29500 },
		{ -300, 300, -31500 },
		{ 300, -150, -32500 },
		{ -200, 250, -34000 },
		{ -300, 300, -35000 },
		{ -600, 300, -36000 },
		{ 1000, -180, -40000 },
		{ 1000, -180, -40000 },
	}
	
