Rainchus/marioparty4/src/REL/m401Dll/main.c
};

void fn_2_7EDC(s32 arg0, s32 arg1, float arg2, Vec *arg3)
{
	Vec *temp_r31;
	Vec *temp_r30;
	Vec *temp_r29;
	Vec *temp_r28;
	float temp_f31 = arg2*arg2;
	if(arg1 == 0) {
		temp_r31 = &lbl_2_data_334[arg0][arg1];
		temp_r30 = &lbl_2_data_334[arg0][arg1+1];
		temp_r29 = &lbl_2_data_334[arg0][arg1+2];
		temp_r28 = &lbl_2_data_334[arg0][arg1+3];
		arg3->x = (0.5f * ((2.0f * temp_r31->x) + ((temp_f31 * (temp_r29->x + (temp_r31->x - (2.0f * temp_r30->x)))) + (arg2 * (((-3.0f * temp_r31->x) + (4.0f * temp_r30->x)) - temp_r29->x)))));
		arg3->y = (0.5f * ((2.0f * temp_r31->y) + ((temp_f31 * (temp_r29->y + (temp_r31->y - (2.0f * temp_r30->y)))) + (arg2 * (((-3.0f * temp_r31->y) + (4.0f * temp_r30->y)) - temp_r29->y)))));
		arg3->z = (0.5f * ((2.0f * temp_r31->z) + ((temp_f31 * (temp_r29->z + (temp_r31->z - (2.0f * temp_r30->z)))) + (arg2 * (((-3.0f * temp_r31->z) + (4.0f * temp_r30->z)) - temp_r29->z)))));
	} else {
		temp_r31 = &lbl_2_data_334[arg0][arg1-1];
		temp_r30 = &lbl_2_data_334[arg0][arg1];
		temp_r29 = &lbl_2_data_334[arg0][arg1+1];
		temp_r28 = &lbl_2_data_334[arg0][arg1+2];
		arg3->x = (0.5f * ((2.0f * temp_r30->x) + ((arg2 * (-temp_r31->x + temp_r29->x)) + ((arg2 * (temp_f31 * (temp_r28->x + ((-temp_r31->x + (3.0f * temp_r30->x)) - (3.0f * temp_r29->x))))) + (temp_f31 * (((4.0f * temp_r29->x) + ((2.0f * temp_r31->x) - (5.0f * temp_r30->x))) - temp_r28->x))))));
		arg3->y = (0.5f * ((2.0f * temp_r30->y) + ((arg2 * (-temp_r31->y + temp_r29->y)) + ((arg2 * (temp_f31 * (temp_r28->y + ((-temp_r31->y + (3.0f * temp_r30->y)) - (3.0f * temp_r29->y))))) + (temp_f31 * (((4.0f * temp_r29->y) + ((2.0f * temp_r31->y) - (5.0f * temp_r30->y))) - temp_r28->y))))));
		arg3->z = (0.5f * ((2.0f * temp_r30->z) + ((arg2 * (-temp_r31->z + temp_r29->z)) + ((arg2 * (temp_f31 * (temp_r28->z + ((-temp_r31->z + (3.0f * temp_r30->z)) - (3.0f * temp_r29->z))))) + (temp_f31 * (((4.0f * temp_r29->z) + ((2.0f * temp_r31->z) - (5.0f * temp_r30->z))) - temp_r28->z))))));
	}
}

s32 fn_2_8450(omObjData *object)
{
	Work7CB4 *temp_r31;
	Vec *temp_r29;
	Vec *temp_r28;
	float temp_f29;
	Vec sp18;
	Vec spC;
	temp_r31 = object->data;
	while(1) {
		if(temp_r31->unk2E == lbl_2_data_32C[temp_r31->unk2C]) {
			return 1;
		}
		temp_r28 = &lbl_2_data_334[temp_r31->unk2C][temp_r31->unk2E+1];
		temp_r29 = &lbl_2_data_334[temp_r31->unk2C][temp_r31->unk2E];
		sp18.x = temp_r28->x - temp_r29->x;
		sp18.y = temp_r28->y - temp_r29->y;
		sp18.z = temp_r28->z - temp_r29->z;
		temp_f29 = VECMagPoint(sp18.x, sp18.y, sp18.z);
		if(temp_r31->unk30 > temp_f29) {
			temp_r31->unk30 -= temp_f29;
			temp_r31->unk2E++;
			continue;
		}
		break;
	}
	fn_2_7EDC(temp_r31->unk2C, temp_r31->unk2E, temp_r31->unk30/temp_f29, &spC);
	sp18.x = spC.x-object->trans.x;
	sp18.y = spC.y-object->trans.y;
	sp18.z = spC.z-object->trans.z;
	VECNormalize(&sp18, &sp18);
	object->trans.x = spC.x;
	object->trans.y = spC.y;
	object->trans.z = spC.z;
	object->rot.y = atan2d(sp18.x, sp18.z);
	object->rot.x = -90.0f*sp18.y;
	return 0;
}

s32 fn_2_873C(omObjData *object)
{
	Work7CB4 *temp_r30;
	Vec sp8;
	temp_r30 = object->data;
	if(object->trans.x > -400.0f 
		&& object->trans.x < 400.0f
		&& object->trans.z-lbl_2_bss_60.z < 300.0f
		&& object->trans.y > -300.0f
		&& object->trans.y < 300.0f) {
		if(temp_r30->unk1E == 0) {
			if(temp_r30->unk20 != 0) {
				temp_r30->unk20--;
				sp8.x = object->trans.x;
				sp8.y = object->trans.y;
				sp8.z = object->trans.z-lbl_2_bss_60.z;
				fn_2_10A88(&sp8, 1);
				return 1;
			}
			
		} else {
			temp_r30->unk1E--;
		}
	}
	return 0;
}

void fn_2_8968(omObjData *object);

void fn_2_8868(omObjData *object)
{
	Work7CB4 *temp_r31;
	temp_r31 = object->data;
	if(lbl_2_bss_60.z < -20800.0f) {
		Hu3DModelAttrReset(object->model[0], 1);
		temp_r31->unk2C = 0;
		temp_r31->unk2E = 0;
		temp_r31->unk30 = 0;
		temp_r31->unk1E = ((frand()%10)+13)*0.43478262f;
		temp_r31->unk20 = 2;
		fn_2_8450(object);
		object->func = fn_2_8968;
	}
}

void fn_2_8B58(omObjData *object);

void fn_2_8968(omObjData *object)
{
	Work7CB4 *temp_r29;
	temp_r29 = object->data;
	temp_r29->unk30 += 25.875;
	if(fn_2_873C(object)) {
		temp_r29->unk1E = ((frand()%15)+22)*0.43478262f;
	}
	if(fn_2_8450(object)) {
		Hu3DModelAttrSet(object->model[0], 1);
		object->func = fn_2_8B58;
	}
}

void fn_2_8C58(omObjData *object);

void fn_2_8B58(omObjData *object)
{
	Work7CB4 *temp_r31;
	temp_r31 = object->data;
	if(lbl_2_bss_60.z < -30500.0f) {
		Hu3DModelAttrReset(object->model[0], 1);
		temp_r31->unk2C = 1;
		temp_r31->unk2E = 0;
		temp_r31->unk30 = 0;
		temp_r31->unk1E = ((frand()%60)+50)*0.43478262f;
		temp_r31->unk20 = 3;
		fn_2_8450(object);
		object->func = fn_2_8C58;
	}
}

s32 lbl_2_data_424[] = {
	50, 95
};

void fn_2_8C58(omObjData *object)
{
	Work7CB4 *temp_r29;
	temp_r29 = object->data;
	temp_r29->unk30 += 25.875;
	if(fn_2_873C(object)) {
		temp_r29->unk1E = ((frand()%15)+lbl_2_data_424[lbl_2_bss_14++])*0.43478262f;
	}
	if(fn_2_8450(object)) {
		Hu3DModelAttrSet(object->model[0], 1);
		object->func = NULL;
	}
}

typedef struct work_8E74 {
	Vec unk0;
	Vec unkC;
	Vec unk18;
	Vec unk24;
	float unk30;
	Vec unk34;
} Work8E74;

void fn_2_9298(omObjData *object);

void fn_2_8E74(omObjData *object)
{
	Work8E74 *temp_r31;
	object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work8E74), MEMORY_DEFAULT_NUM);
	temp_r31 = object->data;
	temp_r31->unk24.x = 6;
	temp_r31->unk24.z = 90;
	temp_r31->unk24.y = 100;
	object->model[0] = Hu3DModelCreateFile(0x20000D);
	object->motion[0] = Hu3DJointMotionFile(object->model[0], 0x200010);
	Hu3DMotionSet(object->model[0], object->motion[0]);
	Hu3DModelAttrSet(object->model[0], 0x40000001);
	Hu3DModelAttrSet(object->model[0], 1);
	omSetTra(object, -1000, 0, -23000);
	omSetRot(object, 0, 90, 0);
	temp_r31->unkC.x = 1000.0f-object->trans.x;
	temp_r31->unkC.y = temp_r31->unk24.y-object->trans.y;
	temp_r31->unkC.z = 0;
	temp_r31->unk34.x = 1000;
	temp_r31->unk34.y = 30;
	temp_r31->unk34.z = 360.0f+((1.0f/255.0f)*(u32)frand8());
	temp_r31->unk30 = VECMagPoint(temp_r31->unkC.x, temp_r31->unkC.y, temp_r31->unkC.z);
	VECNormalize(&temp_r31->unkC, &temp_r31->unk0);
	Hu3DModelShadowSet(object->model[0]);
	object->work[3] = 2;
	object->func = fn_2_9298;
}

void fn_2_91AC(omObjData *object, Vec *pos)
{
	Work8E74 *temp_r30;
	temp_r30 = object->data;
	temp_r30->unk18 = *pos;
	temp_r30->unk34.z = (1.0f/255.0f)*(360.0f*(u32)frand8());
	Hu3DModelAttrReset(object->model[0], 1);
	omSetTra(object, pos->x, pos->y, pos->z);
	object->work[2] = HuAudFXEmiterPlay(1284, &pos);
	object->func = fn_2_9298;
}

