Rainchus/marioparty4/src/REL/m401Dll/main.c
void fn_2_9298(omObjData *object)
{
	Work8E74 *temp_r31;
	float temp_f29;
	Vec spC;
	temp_r31 = object->data;
	object->trans.x = temp_r31->unk18.x+1000.0f*sind(temp_r31->unk34.z);
	temp_f29 = (temp_r31->unk34.y/temp_r31->unk34.x)*sqrtf((temp_r31->unk34.x*temp_r31->unk34.x)-(object->trans.x*object->trans.x));
	if(temp_r31->unk34.z >= 90.0f && temp_r31->unk34.z <= 270.0f) {
		temp_f29 = -temp_f29;
	}
	object->trans.z = temp_r31->unk18.z+temp_f29;
	temp_r31->unk34.z += 0.6f+(0.6f*fabs(cosd(temp_r31->unk34.z)));
	if(temp_r31->unk34.z >= 360.0f) {
		temp_r31->unk34.z -= 360.0f;
	}
	omSetRot(object, 0, 90.0f+temp_r31->unk34.z , 0);
	spC.x = object->trans.x;
	spC.y = object->trans.y;
	spC.z = object->trans.z;
	HuAudFXEmiterUpDate(object->work[2], &spC);
	if(object->trans.z > lbl_2_bss_6C.z-220.0f) {
		Hu3DModelAttrSet(object->model[0], 1);
		HuAudFXStop(object->work[2]);
		object->func = NULL;
	}
}

void fn_2_979C(omObjData *object);

void fn_2_95E4(omObjData *object)
{
	object->model[0] = Hu3DModelCreateFile(0x200018);
	object->motion[0] = Hu3DJointMotionFile(object->model[0], 0x200019);
	object->motion[1] = Hu3DJointMotionFile(object->model[0], 0x20001A);
	omSetTra(object, 3000, 0, -37000);
	omSetRot(object, 0, 270, 0);
	Hu3DMotionSet(object->model[0], object->motion[0]);
	Hu3DModelAttrSet(object->model[0], 0x1);
	Hu3DModelAttrSet(object->model[0], 0x40000001);
	object->work[3] = 3;
	Hu3DModelShadowSet(object->model[0]);
	object->func = fn_2_979C;
}

void fn_2_9734(s32 flag)
{
	if(flag) {
		Hu3DModelAttrReset(lbl_2_bss_FC->model[0], 1);
	} else {
		Hu3DModelAttrSet(lbl_2_bss_FC->model[0], 1);
	}
}

void fn_2_988C(omObjData *object);

void fn_2_979C(omObjData *object)
{
	if(lbl_2_bss_60.z < -19000.0f) {
		fn_2_9734(1);
		omSetTra(object, -2500, -800, -21000);
		omSetRot(object, 0, 125, 0);
		Hu3DMotionSet(object->model[0], object->motion[0]);
		Hu3DModelAttrSet(object->model[0], 0x40000001);
		object->func = fn_2_988C;
	}
}

void fn_2_99A4(omObjData *object);

void fn_2_988C(omObjData *object)
{
	object->trans.x += 2.3f*(26.0*sind(object->rot.y));
	object->trans.z += 2.3f*(26.0*cosd(object->rot.y));
	if(object->trans.x > 6000.0f) {
		fn_2_9734(0);
		object->func = fn_2_99A4;
	}
}

void fn_2_9B90(omObjData *object);

void fn_2_99A4(omObjData *object)
{
	float temp_f31;
	if(lbl_2_bss_60.z <= -36200.0f+((1.0f/255.0f)*(200.0f*(u32)frand8()))) {
		temp_f31 = -250.0f+((1.0f/255.0f)*(500.0f*(u32)frand8()));
		fn_2_9734(1);
		omSetTra(object, 3000, temp_f31, -37000);
		omSetRot(object, 0, 270, 0);
		Hu3DMotionSet(object->model[0], object->motion[0]);
		Hu3DModelAttrSet(object->model[0], 0x40000001);
		object->func = fn_2_9B90;
		lbl_2_bss_78.x = object->trans.x;
		lbl_2_bss_78.y = object->trans.y;
		lbl_2_bss_78.z = object->trans.z;
		lbl_2_bss_8C = HuAudFXEmiterPlay(1286, &lbl_2_bss_78);
	}
}

void fn_2_9B90(omObjData *object)
{
	object->trans.x += 2.3f*(17.0*sind(object->rot.y));
	object->trans.z += 2.3f*(17.0*cosd(object->rot.y));
	lbl_2_bss_78.x = object->trans.x;
	lbl_2_bss_78.y = object->trans.y;
	lbl_2_bss_78.z = object->trans.z;
	HuAudFXEmiterUpDate(lbl_2_bss_8C, &lbl_2_bss_78);
	if(object->trans.x <= -3000.0f) {
		fn_2_9734(0);
		object->func = NULL;
		HuAudFXStop(lbl_2_bss_8C);
	}
}

typedef struct work_a318 {
	Vec unk0;
	s16 unkC;
} Work9E28;

s32 lbl_2_data_42C[] = {
	0x20001C,
	0x20001D
};

void fn_2_9D00(Process *objman)
{
	omObjData *temp_r31;
	s32 temp_r30;
	s32 temp_r29;
	for(temp_r29=0; temp_r29<4; temp_r29++) {
		temp_r31 = omAddObjEx(objman, 1130, 1, 2, -1, NULL);
		lbl_2_bss_E4[temp_r29] = temp_r31;
		temp_r31->model[0] = Hu3DModelCreateFile(0x20001B);
		for(temp_r30=0; temp_r30<2; temp_r30++) {
			temp_r31->motion[temp_r30] = Hu3DJointMotionFile(temp_r31->model[0], lbl_2_data_42C[temp_r30]);
		}
		Hu3DModelAttrSet(temp_r31->model[0], 1);
		temp_r31->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work9E28), MEMORY_DEFAULT_NUM);
		Hu3DModelShadowSet(temp_r31->model[0]);
		temp_r31->work[3] = 1;
	}
}

void fn_2_A318(omObjData *object);


void fn_2_9E28(float arg1, float arg2)
{
	s32 temp_r31;
	Work9E28 *temp_r30;
	float temp_f31;
	float temp_f30;
	float temp_f29;
	temp_f30 = (arg2-arg1)/4;
	temp_f31 = arg1;
	for(temp_r31=0; temp_r31<4; temp_r31++) {
		temp_r30 = lbl_2_bss_E4[temp_r31]->data;
		Hu3DModelAttrReset(lbl_2_bss_E4[temp_r31]->model[0], 1);
		temp_f29 = -400.0f+((1.0f/255.0f)*(800.0f*(u32)frand8()));
		temp_r30->unk0.x = -250.0f+((1.0f/255.0f)*(500.0f*(u32)frand8()));
		omSetTra(lbl_2_bss_E4[temp_r31], temp_f29, temp_r30->unk0.x+lbl_2_bss_60.y, temp_f31);
		Hu3DMotionSet(lbl_2_bss_E4[temp_r31]->model[0], lbl_2_bss_E4[temp_r31]->motion[0]);
		Hu3DModelAttrSet(lbl_2_bss_E4[temp_r31]->model[0], 0x40000001);
		temp_f31 += temp_f30;
		temp_r30->unkC = (frand()%30)+30;
		temp_r30->unk0.z = 0;
		lbl_2_bss_E4[temp_r31]->func = fn_2_A318;
	}
}

omObjData *fn_2_A0B0(omObjData *object)
{
	omObjData *temp_r31;
	s32 temp_r30;
	omObjData *temp_r29;
	M401WorkPlayer *spC;
	
	float temp_f27;
	float temp_f26;
	temp_f26 = 999999;
	for(temp_r30=0; temp_r30<4; temp_r30++) {
		float temp_f31;
		float temp_f30;
		float temp_f29;
		temp_r31 = lbl_2_bss_118[temp_r30];
		spC = temp_r31->data;
		temp_f31 = temp_r31->trans.x - object->trans.x;
		temp_f30 = temp_r31->trans.y - object->trans.y;
		temp_f29 = 0.4f*(temp_r31->trans.z - object->trans.z);
		temp_f27 = VECMagPoint(temp_f31, temp_f30, temp_f29);
		if(temp_f27 < temp_f26) {
			temp_r29 = lbl_2_bss_118[temp_r30];
			temp_f26 = temp_f27;
		}
	}
	return temp_r29;
}

void fn_2_A318(omObjData *object)
{
	Work9E28 *temp_r30;
	omObjData *temp_r28;
	M401WorkPlayer *sp10;
	temp_r30 = object->data;
	if(0.0f == temp_r30->unk0.z) {
		if(temp_r30->unkC == 0) {
			temp_r28 = fn_2_A0B0(object);
			sp10 = temp_r28->data;
			temp_r30->unk0.y = atan2d(temp_r28->trans.y - object->trans.y, temp_r28->trans.x - object->trans.x);
			temp_r30->unk0.z = 8.0f+((1.0f/255.0f)*((9.0f*(u32)frand8())));
			Hu3DMotionSet(object->model[0], object->motion[1]);
			Hu3DModelAttrReset(object->model[0], 0x40000001);
			lbl_2_bss_78.x = object->trans.x;
			lbl_2_bss_78.y = object->trans.y;
			lbl_2_bss_78.z = object->trans.z;
			HuAudFXEmiterPlay(1282, &lbl_2_bss_78);
		} else {
			temp_r30->unkC--;
			temp_r30->unk0.x -= 2.5f;
		}
	} else {
		temp_r30->unk0.x = temp_r30->unk0.x+(temp_r30->unk0.z*sind(temp_r30->unk0.y));
		object->trans.x += temp_r30->unk0.z*cosd(temp_r30->unk0.y);
		temp_r30->unk0.z *= 0.94f;
		if(temp_r30->unk0.z < 0.1f) { 
			temp_r30->unk0.z = 0;
			temp_r30->unkC = (frand()%30)+25;
			Hu3DMotionSet(object->model[0], object->motion[0]);
			Hu3DModelAttrSet(object->model[0], 0x40000001);
		}
	}
	if(temp_r30->unk0.x < -300.0f) {
		temp_r30->unk0.x = -300.0f;
	}
	if(temp_r30->unk0.x > 300.0f) {
		temp_r30->unk0.x = 300.0f;
	}
	if(object->trans.x < -400.0f) {
		object->trans.x = -400.0f;
	}
	if(object->trans.x > 400.0f) {
		object->trans.x = 400.0f;
	}
	omSetTra(object, object->trans.x, temp_r30->unk0.x+lbl_2_bss_60.y, object->trans.z);
	if(object->trans.z > lbl_2_bss_6C.z-160.0f) {
		Hu3DModelAttrSet(object->model[0], 1);
		object->func = NULL;
	}
}

